package cn.ryanliu.task5;
/* 任务需求:
*某果农需要用1000元采购3种树苗,每种树苗至少购买一颗,合计购买30棵.树苗的单价分别是金桔30元,猕猴桃40元,石榴50元.
* */

//这个需求在于使用嵌套的for循环
public class BuySapling {
    public static void main(String[] args) {
        int j;      //定义j,代表金桔数量,每颗30元
        int m;      //定义m,代表猕猴桃数量,每颗40元
        int n;      //定义n,代表石榴数量,每颗50元

        System.out.println("金桔猕猴桃石榴");

        //用嵌套的for循环给出采购方案
        for (j=1;j<1000/30;j++){//金桔树苗至少一颗,且小于1000/30棵
            for (m=1;m<1000/40;m++){//猕猴桃树苗至少一颗,且小于1000/40棵
                //总共采购30棵树苗,则石榴树苗数量是30-金桔-猕猴桃树苗的数量
                n=30-j-m;
                if (30*j+40*m+50*n==1000) {
                    //当三种树苗的总价格为1000时,输出采购方案
                    System.out.println(j + "\t" + m + "\t" + n);
                }
            }
        }
    }

}
